Add: Changes - replaced dotcode with mermaid.
